#!/bin/bash

if ! [[ "$1" =~ ^-?[0-9]+(\.[0-9]+)?$ ]] || ! [[ "$2" =~ ^-?[0-9]+(\.[0-9]+)?$ ]]
then
  echo "Ошибка: первые два элемента должны быть числами"

else
  case "$3" in
    +)
    echo "Сумма: $(($1 + $2))"
    ;;
    -)
    echo "Разность: $(($1 - $2))"
    ;;
    \*)
    echo "Произведение: $(($1 * $2))"
    ;;
    /)
      if [ "$2" == 0 ]
      then
        echo "На ноль делить нельзя"
      else
        echo "Частное: $(($1 / $2))"
      fi
    ;;
    *)
    echo "Неизвестная операция"
    ;;
  esac
fi
